% glassf04.m                                                        %    FUJII
%-----------------------------------------------------------------------------------
% ガラスの入射角別熱取得率を求める
% 空気調和衛生工学便覧第12版　3 空気調和設備設計篇　P93参照
% 式を滝沢の式に変更                    (2004/9/16 藤井)
%-----------------------------------------------------------------------------------
%　入力  sh:面から見た太陽高度の正弦　
%　出力   g:標準ガラス(透明3mm)の入射角別熱取得
%-----------------------------------------------------------------------------------
function g = glassf04(sh)

% ガラスの入射角別熱取得率を求める(空気調和衛生工学便覧第12版　3 空気調和設備設計篇　P93 2.115式参照)

g = sh * (2.63899 + sh * (1.00185 + sh * (-19.9934 + sh * (53.6021 + sh * (-79.2915 + sh * (70.6736 + sh * (-35.3006 + sh * 7.55907 )))))));

